{
  "company": {
    "name": "PT Multi Spunindo Jaya Tbk",
    "logoUrl": "assets/img/logo.png",
    "tagline": "Magang MIS (Management Information System)"
  },
  "ui": {
    "nextLabel": "Slide Berikutnya",
    "prevLabel": "Slide Sebelumnya",
    "nextShortLabel": "›",
    "prevShortLabel": "‹",
    "fullscreenLabel": "Mode Layar Penuh (F)",
    "slideIndicatorPrefix": "Slide",
    "slideSeparator": "/"
  },
  "slides": [
    {
      "id": "opening",
      "type": "opening",
      "title": "Laporan Presentasi Magang",
      "subtitle": "Program Magang Divisi MIS - PT Multi Spunindo Jaya Tbk",
      "navLabel": "Opening",
      "items": [
        "Moch. Reynald Silva Baktiar",
        "Program Studi D-IV Teknik Informatika",
        "Politeknik Negeri Malang",
        "Periode: Agustus 2025 - Desember 2025"
      ],
      "media": {
        "src": "assets/img/logo.png",
        "alt": "Logo PT Multi Spunindo Jaya Tbk",
        "caption": "PT Multi Spunindo Jaya Tbk - Divisi MIS"
      }
    },
    {
      "id": "perkenalan",
      "type": "bullet",
      "title": "Perkenalan",
      "subtitle": "Profil singkat mahasiswa magang",
      "navLabel": "Perkenalan",
      "items": [
        "Nama: Moch. Reynald Silva Baktiar, Program Studi D-IV Teknik Informatika",
        "Periode magang: Agustus 2025 – Desember 2025",
        "Penempatan: Divisi MIS,  PT Multi Spunindo Jaya Tbk",
        "Pembimbing lapangan: Nurfaizin Faiz – Foreman",
        "Tujuan presentasi: memberikan gambaran menyeluruh mengenai pengalaman dan hasil magang"
      ]
    },
    {
      "id": "pendahuluan",
      "type": "paragraph",
      "title": "Pendahuluan",
      "subtitle": "Latar belakang, tujuan, dan ruang lingkup kegiatan magang",
      "navLabel": "Pendahuluan",
      "paragraphs": [
        "Program magang di PT Multi Spunindo Jaya Tbk, khususnya pada Divisi Management Information System (MIS), dirancang untuk memberikan pengalaman kerja praktis kepada mahasiswa dalam lingkungan industri manufaktur yang terstruktur dan berbasis sistem informasi.",
        "Selama periode magang, fokus utama kegiatan adalah pengembangan sistem koperasi karyawan yang sebelumnya masih dikelola secara manual menggunakan Microsoft Excel, kemudian ditransformasikan menjadi sistem terkomputerisasi yang lebih terintegrasi, efisien, dan akurat. Proses pengembangan meliputi analisis kebutuhan pengguna, perancangan sistem, implementasi, hingga pengujian dan dokumentasi.",
        "Laporan magang ini merangkum seluruh rangkaian aktivitas yang telah dilakukan, hasil pengembangan sistem koperasi, serta pembelajaran teknis dan non-teknis yang diperoleh selama magang, sekaligus memberikan gambaran singkat mengenai profil dan peran PT Multi Spunindo Jaya Tbk sebagai tempat pelaksanaan magang."
      ]
    },
    {
      "id": "profil-perusahaan",
      "type": "bullet",
      "title": "Profil Perusahaan",
      "subtitle": "Gambaran singkat PT Multi Spunindo Jaya Tbk",
      "navLabel": "Profil Perusahaan",
      "items": [
        "Bidang usaha: produsen bahan nonwoven yang digunakan sebagai bahan baku industri kesehatan, konstruksi, pertanian, otomotif, dan produk konsumen lainnya, berbasis manufaktur tekstil nonwoven B2B.",
        "Segmentasi klien: perusahaan industri kesehatan (mis. popok, pembalut, masker), konstruksi, agrikultur, otomotif, serta sektor manufaktur yang membutuhkan material nonwoven di dalam produknya.",
        "Produk utama: lembaran nonwoven berbasis polypropylene, polyester (PET), polyethylene (PE), spunbond, meltblown, dan composite nonwoven yang memiliki berbagai aplikasi industri.",
        "Nilai utama: komitmen terhadap kualitas tinggi dengan penerapan Total Quality Management (TQM), inovasi berkelanjutan dalam produksi material nonwoven, serta fokus pada keandalan dan konsistensi produk.",
        "Budaya kerja: pemanfaatan fasilitas modern dan sistem manajemen mutu, kolaborasi antar tim produksi dan teknis, serta orientasi pada pengembangan kompetensi karyawan untuk mendukung operasi 24 jam non-stop."
        ],
      "media": {
        "src": "assets/img/profile.png",
        "alt": "Ilustrasi kantor modern dan tim profesional",
        "caption": "Ilustrasi lingkungan kerja modern yang mencerminkan budaya kolaboratif dan fokus pada pengembangan solusi teknologi."
      }
    },
    {
      "id": "kegiatan-magang-garis-besar",
      "type": "bullet",
      "title": "Kegiatan Magang",
      "subtitle": "Garis besar aktivitas dan tanggung jawab utama",
      "navLabel": "Kegiatan Magang",
      "items": [
        "Melakukan analisis kebutuhan sistem koperasi melalui meeting dengan pengurus koperasi untuk menggali proses bisnis nyata, termasuk simpanan, pinjaman, perhitungan SHU, dan potongan gaji karyawan.",
        "Merancang dan mengembangkan sistem koperasi terintegrasi yang sebelumnya dikelola secara manual menggunakan Excel, mencakup pengelolaan anggota, simpanan, pinjaman, angsuran, dan SHU.",
        "Mengimplementasikan perhitungan otomatis Sisa Hasil Usaha (SHU) serta perhitungan potongan gaji karyawan setiap bulan sebagai data pendukung integrasi dengan sistem HRIS.",
        "Membangun struktur database sistem koperasi yang terintegrasi dan konsisten untuk menjamin keakuratan data transaksi dan laporan.",
        "Melaksanakan User Acceptance Test (UAT) bersama pengurus koperasi dengan menggunakan data riil untuk memastikan sistem telah sesuai dengan kebutuhan pengguna, mudah digunakan, dan menghasilkan perhitungan yang akurat.",
        "Melakukan perbaikan dan penyesuaian sistem berdasarkan hasil UAT dan umpan balik pengguna sebelum sistem dinyatakan siap digunakan."
        ]
    },
    {
      "id": "tugas-khusus",
      "type": "bullet",
      "title": "Tugas Khusus",
      "subtitle": "Penugasan khusus selama magang di Divisi MIS",
      "navLabel": "Tugas Khusus",
      "items": [
        "Mengimplementasikan penyesuaian atau fitur tertentu pada sistem koperasi sesuai permintaan khusus pengurus koperasi maupun Divisi MIS.",
        "Menyusun laporan atau dashboard khusus untuk mendukung pengambilan keputusan manajemen berdasarkan data transaksi koperasi.",
        "Mendokumentasikan secara rinci alur proses, aturan perhitungan, dan panduan penggunaan untuk penugasan khusus yang dikerjakan.",
        "Melaksanakan penugasan tambahan yang diberikan langsung oleh pembimbing lapangan terkait kebutuhan sistem informasi di PT Multi Spunindo Jaya Tbk.",
        "Membuat Artisan CLI command untuk MSJFramework guna mempermudah workflow (RBAC, routing, layouting UI, dan konfigurasi lainnya) yang sebelumnya sulit ditangani melalui UI superadmin." 
      ]
    },
    {
      "id": "hasil-tugas-khusus",
      "type": "bullet",
      "title": "Hasil Tugas Khusus",
      "subtitle": "Output nyata dari penugasan khusus selama magang",
      "navLabel": "Hasil Tugas Khusus",
      "items": [
        "Menyerahkan dokumentasi lengkap berupa SOP, flowchart proses, dan panduan penggunaan untuk mempermudah developer dalam mengoperasikan dan memelihara Artisan CLI command MSJFramework.",
        "Memberikan rekomendasi perbaikan dan pengembangan lanjutan berdasarkan hasil pengujian dan umpan balik dari pengguna terkait penugasan khusus yang dikerjakan.",
        "Mengembangkan dan menguji Artisan CLI command yang mengotomatisasi pengaturan RBAC, routing, dan layout UI MSJFramework sehingga mempercepat deployment dan mengurangi kesalahan manual."
      ],
      "media": {
        "src": "assets/img/7.png",
        "alt": "Artisan Command CLI MSJFramework",
        "caption": "Pengembangan Artisan Command CLI untuk mempermudah workflow MSJFramework"
      }
    },
    {
      "id": "galeri-kegiatan",
      "type": "gallery",
      "title": "Galeri Kegiatan Magang",
      "subtitle": "Dokumentasi aktivitas dan suasana kerja selama magang",
      "navLabel": "Galeri",
      "gallery": {
        "images": [
          {
            "src": "assets/img/1.jpeg",
            "alt": "Sesi praktikum di lab komputer",
            "caption": "Suasana lab komputer saat sesi pembelajaran dan praktikum bersama mahasiswa Politeknik Negeri Malang",
            "description": [
              "Perkenalan magang (induksi): sesi orientasi di mana pihak PT Multi Spunindo Jaya Tbk menjelaskan peraturan magang, tata tertib, keselamatan kerja, dan fasilitas yang tersedia bagi peserta magang."
            ]
          },
          {
            "src": "assets/img/2.jpeg",
            "alt": "Presentasi Laravel Framework",
            "caption": "Video YouTube 'Pendahuluan Framework Laravel' oleh Ti Intro - Belajar Laravel",
            "description": [
              "Sesi pembelajaran Laravel yang bertujuan mempermudah pemahaman terhadap framework internal perusahaan (MSJFramework) yang dibangun di atas Laravel."
            ]
          },
          {
            "src": "assets/img/3.jpeg",
            "alt": "Perencaanaan Proyek ",
            "caption": "Proses coding Laravel - menampilkan konfigurasi routing dan middleware authentication",
            "description": [
              "Mengatur timeline pengerjaan proyek koperasi: perencanaan milestone, pembagian tugas, dan estimasi waktu untuk setiap fase pengembangan.",
              "Dokumentasi ini membantu koordinasi tim, monitoring progress, dan validasi hasil terhadap kebutuhan pengguna."
            ]
          },
          {
            "src": "assets/img/4.jpg",
            "alt": "Sesi penjelasan sistem di whiteboard",
            "caption": "Penjelasan konsep 'Debit Pinjaman' dan struktur data EPS-Pinjaman menggunakan whiteboard",
            "description": [
              "Meeting lanjutan: diskusi dengan pembimbing setelah pertemuan dengan pengurus koperasi untuk menyampaikan hasil meeting user dan merumuskan langkah teknis yang akan diimplementasikan.",
              "Pembahasan mencakup prioritas fitur, penyesuaian skema data, serta pembagian tugas teknis untuk tim pengembang agar hasil meeting dapat diterjemahkan menjadi solusi yang dapat di-deploy."
            ]
          },
          {
            "src": "assets/img/5.jpg",
            "alt": "Cuplikan MSJ Koperasi - Dashboard",
            "caption": "Cuplikan tampilan fitur utama pada aplikasi MSJ Koperasi (MSJKoperasi)",
            "description": [
              "Cuplikan tampilan dari fitur pada aplikasi MSJ Koperasi (MSJKoperasi) — contoh tata letak dashboard dan widget ringkasan.",
              "Detail transaksi telah disamarkan untuk tujuan presentasi dan privasi data pengguna."
            ]
          },
          {
            "src": "assets/img/6.png",
            "alt": "Artisan Command CLI MSJFramework",
            "caption": "Pengembangan Artisan Command CLI untuk mempermudah workflow MSJFramework",
            "description": [
              "Pengembangan Artisan Command CLI yang dibuat untuk mempermudah workflow MSJFramework dalam pengaturan RBAC, routing, layouting UI, dan konfigurasi lainnya.",
              "Command CLI ini menggantikan proses manual yang sebelumnya harus dilakukan melalui UI superadmin web, membuat workflow menjadi lebih efisien dan mudah diingat.",
              "Flow melalui CLI ini bersifat berurutan, tidak seperti pada tampilan web superadmin yang memerlukan pengurutan manual dan membutuhkan waktu lebih lama untuk training karyawan atau developer baru."
            ]
          }
        ]
      }
    },
    {
      "id": "hasil-output",
      "type": "bullet",
      "title": "Hasil dan Output",
      "subtitle": "Kontribusi konkret selama masa magang",
      "navLabel": "Hasil / Output",
      "items": [
        "Menghasilkan sistem koperasi berbasis digital yang menggantikan proses manual berbasis Excel, mencakup pengelolaan data anggota, simpanan, pinjaman, angsuran, dan laporan.",
        "Mengimplementasikan fitur perhitungan otomatis Sisa Hasil Usaha (SHU) berdasarkan data transaksi koperasi.",
        "Menyusun mekanisme perhitungan potongan gaji karyawan setiap bulan sebagai data pendukung untuk integrasi dengan sistem HRIS.",
        "Membangun dan mengelola database sistem koperasi yang terstruktur untuk memastikan konsistensi dan keakuratan data.",
        "Melaksanakan User Acceptance Test (UAT) bersama pengurus koperasi dan melakukan penyempurnaan sistem berdasarkan umpan balik pengguna.",
        "Menyusun dokumentasi sistem dan laporan akhir magang sebagai acuan penggunaan sistem dan kebutuhan akademik."
        ]
    },
    {
      "id": "kesimpulan",
      "type": "paragraph",
      "title": "Kesimpulan",
      "subtitle": "Ringkasan pembelajaran dan manfaat program magang",
      "navLabel": "Kesimpulan",
     "paragraphs": [
        "Pelaksanaan program magang di PT Multi Spunindo Jaya Tbk Divisi MIS memberikan pengalaman nyata dalam pengembangan sistem informasi yang digunakan langsung dalam proses operasional perusahaan.",
        "Melalui pengembangan sistem koperasi yang sebelumnya dikelola secara manual menggunakan Excel, kegiatan magang ini berhasil menghasilkan solusi digital yang mencakup pengelolaan data anggota, simpanan, pinjaman, perhitungan SHU, serta potongan gaji karyawan yang mendukung kebutuhan HRIS.",
        "Proses analisis kebutuhan, perancangan database, implementasi sistem, hingga pelaksanaan User Acceptance Test (UAT) bersama pengurus koperasi memberikan pemahaman menyeluruh mengenai siklus pengembangan sistem berbasis kebutuhan pengguna nyata.",
        "Secara keseluruhan, program magang ini tidak hanya meningkatkan kompetensi teknis dalam pengembangan sistem informasi, tetapi juga melatih kemampuan komunikasi, analisis bisnis, dan penyelesaian masalah yang menjadi bekal penting untuk pengembangan karier di bidang teknologi informasi."
        ]
    },
    {
      "id": "terima-kasih",
      "type": "bullet",
      "title": "Terima Kasih",
      "subtitle": "Apresiasi kepada perusahaan, pembimbing, dan tim terkait",
      "navLabel": "Terima Kasih",
      "items": [
        "Terima kasih kepada manajemen PT Multi Spunindo Jaya Tbk atas kesempatan magang yang diberikan.",
        "Apresiasi kepada pembimbing lapangan dan seluruh anggota tim atas arahan, dukungan, dan kepercayaan selama proses magang.",
        "Ucapan terima kasih kepada dosen pembimbing dan pihak kampus yang memfasilitasi program magang ini.",
        "Harapan untuk dapat terus menjaga hubungan baik dan menjalin kolaborasi di masa mendatang."
      ]
    }
  ]
}